; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 464026 2 3 2 3 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	Star2 - direction
	Star1 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon3)
	(pointing satellite1 Star1)
	(have_image Phenomenon3 thermograph0)
	(have_image Phenomenon4 image1)
))

)

; plan
1. (turn_to satellite1 star1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star1)
   goals met: 1 of 4
2. (turn_to satellite0 star1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star1)
   goals met: 1 of 4
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 4
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 4
5. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 4
6. (turn_to satellite1 phenomenon4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon4)
   goals met: 0 of 4
7. (turn_to satellite0 phenomenon4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon4)
   goals met: 0 of 4
8. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   goals met: 1 of 4
9. (take_image satellite0 phenomenon4 instrument1 image1)
   added: (have_image phenomenon4 image1)
   goals met: 2 of 4
10. (turn_to satellite1 phenomenon3 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon3)
   goals met: 1 of 4
11. (turn_to satellite0 phenomenon3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon3)
   goals met: 2 of 4
12. (turn_to satellite1 star1 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 star1)
   goals met: 3 of 4
13. (take_image satellite0 phenomenon3 instrument1 thermograph0)
   added: (have_image phenomenon3 thermograph0)
   goals met: 4 of 4
